---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionLprofileLipLength
source: html/7ee0c67f-a9ae-6413-223d-35e46c2c6a47.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionLprofileLipLength Property

"Lip Length"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionLprofileLipLength { get; }
```